var x = +prompt("Введите число X");//Создаем переменную X и присваеваем к ниму значение введенное пользователем (в диалоговом окне введется текст в виде запроса ввести число X)
var y = +prompt("Введите число Y");//Создаем переменную Y и присваеваем к ниму значение введенное пользователем (в диалоговом окне введется текст в виде запроса ввести число Y)
var z = +prompt("Введите число Z");//Создаем переменную Z и присваеваем к ниму значение введенное пользователем (в диалоговом окне введется текст в виде запроса ввести число Z)
var res = (x + y + z) / 3;// Создаем переменную с формулой для расчета ср. ар. знач. из трех чисел введенных пользователем
alert(res);//Выводим полученное значение из расчитанной формулы (Вывод результата)


